In [ ]:
%pip install openpyxl

Requirement already satisfied: openpyxl in /home/mrx/miniconda3/envs/myenv/lib/python3.10/site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in /home/mrx/miniconda3/envs/myenv/lib/python3.10/site-packages (from openpyxl) (1.1.0)

In [654]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [655]:
df = pd.read_excel('flight_price.xlsx')
df.head()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897
1,Air India,1/05/2019,Kolkata,Banglore,CCU → IXR → BBI → BLR,05:50,13:15,7h 25m,2 stops,No info,7662
2,Jet Airways,9/06/2019,Delhi,Cochin,DEL → LKO → BOM → COK,09:25,04:25 10 Jun,19h,2 stops,No info,13882
3,IndiGo,12/05/2019,Kolkata,Banglore,CCU → NAG → BLR,18:05,23:30,5h 25m,1 stop,No info,6218
4,IndiGo,01/03/2019,Banglore,New Delhi,BLR → NAG → DEL,16:50,21:35,4h 45m,1 stop,No info,13302

In [656]:
df.tail()

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
10678,Air Asia,9/04/2019,Kolkata,Banglore,CCU → BLR,19:55,22:25,2h 30m,non-stop,No info,4107
10679,Air India,27/04/2019,Kolkata,Banglore,CCU → BLR,20:45,23:20,2h 35m,non-stop,No info,4145
10680,Jet Airways,27/04/2019,Banglore,Delhi,BLR → DEL,08:20,11:20,3h,non-stop,No info,7229
10681,Vistara,01/03/2019,Banglore,New Delhi,BLR → DEL,11:30,14:10,2h 40m,non-stop,No info,12648
10682,Air India,9/05/2019,Delhi,Cochin,DEL → GOI → BOM → COK,10:55,19:15,8h 20m,2 stops,No info,11753

In [657]:
df.shape

(10683, 11)

In [658]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 11 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Airline          10683 non-null  object
 1   Date_of_Journey  10683 non-null  object
 2   Source           10683 non-null  object
 3   Destination      10683 non-null  object
 4   Route            10682 non-null  object
 5   Dep_Time         10683 non-null  object
 6   Arrival_Time     10683 non-null  object
 7   Duration         10683 non-null  object
 8   Total_Stops      10682 non-null  object
 9   Additional_Info  10683 non-null  object
 10  Price            10683 non-null  int64
dtypes: int64(1), object(10)
memory usage: 918.2+ KB

In [659]:
df.describe() # as all the other

              Price
count  10683.000000
mean    9087.064121
std     4611.359167
min     1759.000000
25%     5277.000000
50%     8372.000000
75%    12373.000000
max    79512.000000

In [660]:
df.head(1)

,Airline,Date_of_Journey,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price
0,IndiGo,24/03/2019,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897

In [661]:
df.Date_of_Journey.head()

0    24/03/2019
1     1/05/2019
2     9/06/2019
3    12/05/2019
4    01/03/2019
Name: Date_of_Journey, dtype: object

In [662]:
df["Day_of_Journey"] = df.Date_of_Journey.str.split('/').str[0]
df.Day_of_Journey.head()

0    24
1     1
2     9
3    12
4    01
Name: Day_of_Journey, dtype: object

In [663]:
df["Month_of_Journey"] = df.Date_of_Journey.str.split('/').str[1]
df.Month_of_Journey.head()

0    03
1    05
2    06
3    05
4    03
Name: Month_of_Journey, dtype: object

In [664]:
df["Year_of_Journey"] = df.Date_of_Journey.str.split('/').str[2]
df.Year_of_Journey.head()

0    2019
1    2019
2    2019
3    2019
4    2019
Name: Year_of_Journey, dtype: object

In [665]:
df.Day_of_Journey = df.Day_of_Journey.astype(int)
df.Month_of_Journey = df.Month_of_Journey.astype(int)
df.Year_of_Journey = df.Year_of_Journey.astype(int)

In [666]:
df.drop(columns=["Date_of_Journey"], axis=1, inplace=True)

In [667]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 13 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Airline           10683 non-null  object
 1   Source            10683 non-null  object
 2   Destination       10683 non-null  object
 3   Route             10682 non-null  object
 4   Dep_Time          10683 non-null  object
 5   Arrival_Time      10683 non-null  object
 6   Duration          10683 non-null  object
 7   Total_Stops       10682 non-null  object
 8   Additional_Info   10683 non-null  object
 9   Price             10683 non-null  int64
 10  Day_of_Journey    10683 non-null  int64
 11  Month_of_Journey  10683 non-null  int64
 12  Year_of_Journey   10683 non-null  int64
dtypes: int64(4), object(9)
memory usage: 1.1+ MB

In [668]:
df.head(1)

,Airline,Source,Destination,Route,Dep_Time,Arrival_Time,Duration,Total_Stops,Additional_Info,Price,Day_of_Journey,Month_of_Journey,Year_of_Journey
0,IndiGo,Banglore,New Delhi,BLR → DEL,22:20,01:10 22 Mar,2h 50m,non-stop,No info,3897,24,3,2019

In [669]:
df["Arrival_Hour"] = df.Arrival_Time.str.split().str[0].str.split(':').str[0]
df["Arrival_Minutes"] = df.Arrival_Time.apply(lambda x: x.split()[0]).str.split(':').str[1]

In [670]:
df.drop('Arrival_Time', axis=1, inplace=True)
df["Arrival_Hour"] = df.Arrival_Hour.astype(int)
df["Arrival_Minutes"] = df.Arrival_Minutes.astype(int)

In [671]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Airline           10683 non-null  object
 1   Source            10683 non-null  object
 2   Destination       10683 non-null  object
 3   Route             10682 non-null  object
 4   Dep_Time          10683 non-null  object
 5   Duration          10683 non-null  object
 6   Total_Stops       10682 non-null  object
 7   Additional_Info   10683 non-null  object
 8   Price             10683 non-null  int64
 9   Day_of_Journey    10683 non-null  int64
 10  Month_of_Journey  10683 non-null  int64
 11  Year_of_Journey   10683 non-null  int64
 12  Arrival_Hour      10683 non-null  int64
 13  Arrival_Minutes   10683 non-null  int64
dtypes: int64(6), object(8)
memory usage: 1.1+ MB

In [672]:
df.head(1)

,Airline,Source,Destination,Route,Dep_Time,Duration,Total_Stops,Additional_Info,Price,Day_of_Journey,Month_of_Journey,Year_of_Journey,Arrival_Hour,Arrival_Minutes
0,IndiGo,Banglore,New Delhi,BLR → DEL,22:20,2h 50m,non-stop,No info,3897,24,3,2019,1,10

In [673]:
df["Departure_Hour"] = df.Dep_Time.str.split(':').str[0]
df["Departure_Minutes"] = df.Dep_Time.str.split(':').str[1]

In [674]:
df.drop('Dep_Time', axis=1, inplace=True)
df["Departure_Hour"] = df.Departure_Hour.astype(int)
df["Departure_Minutes"] = df.Departure_Minutes.astype(int)

In [675]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 15 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Airline            10683 non-null  object
 1   Source             10683 non-null  object
 2   Destination        10683 non-null  object
 3   Route              10682 non-null  object
 4   Duration           10683 non-null  object
 5   Total_Stops        10682 non-null  object
 6   Additional_Info    10683 non-null  object
 7   Price              10683 non-null  int64
 8   Day_of_Journey     10683 non-null  int64
 9   Month_of_Journey   10683 non-null  int64
 10  Year_of_Journey    10683 non-null  int64
 11  Arrival_Hour       10683 non-null  int64
 12  Arrival_Minutes    10683 non-null  int64
 13  Departure_Hour     10683 non-null  int64
 14  Departure_Minutes  10683 non-null  int64
dtypes: int64(8), object(7)
memory usage: 1.2+ MB

In [676]:
df.head(1)

,Airline,Source,Destination,Route,Duration,Total_Stops,Additional_Info,Price,Day_of_Journey,Month_of_Journey,Year_of_Journey,Arrival_Hour,Arrival_Minutes,Departure_Hour,Departure_Minutes
0,IndiGo,Banglore,New Delhi,BLR → DEL,2h 50m,non-stop,No info,3897,24,3,2019,1,10,22,20

In [677]:
df.Total_Stops.unique()

array(['non-stop', '2 stops', '1 stop', '3 stops', nan, '4 stops'],
      dtype=object)

In [678]:
df.Total_Stops.value_counts()

Total_Stops
1 stop      5625
non-stop    3491
2 stops     1520
3 stops       45
4 stops        1
Name: count, dtype: int64

In [679]:
df.Total_Stops.isnull().sum()

1

In [680]:
# df.Total_Stops = df.Total_Stops.map({'non-stop': 0, '1 stop': 1, '2 stops': 2, '3 stops': 3, '4 stops': 4, np.nan: 1})

In [681]:
from sklearn.preprocessing import OrdinalEncoder

# Fill missing before string conversion
df["Total_Stops"] = df["Total_Stops"].fillna("1 stop")

# Encode
encoder = OrdinalEncoder(categories=[["non-stop", "1 stop", "2 stops", "3 stops", "4 stops"]])
df["Total_Stops"] = encoder.fit_transform(df[["Total_Stops"]])

In [682]:
df.Total_Stops = df.Total_Stops.astype(int)

In [683]:
df.head(1)

,Airline,Source,Destination,Route,Duration,Total_Stops,Additional_Info,Price,Day_of_Journey,Month_of_Journey,Year_of_Journey,Arrival_Hour,Arrival_Minutes,Departure_Hour,Departure_Minutes
0,IndiGo,Banglore,New Delhi,BLR → DEL,2h 50m,0,No info,3897,24,3,2019,1,10,22,20

In [684]:
df.drop('Route', axis=1, inplace=True)

In [685]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Airline            10683 non-null  object
 1   Source             10683 non-null  object
 2   Destination        10683 non-null  object
 3   Duration           10683 non-null  object
 4   Total_Stops        10683 non-null  int64
 5   Additional_Info    10683 non-null  object
 6   Price              10683 non-null  int64
 7   Day_of_Journey     10683 non-null  int64
 8   Month_of_Journey   10683 non-null  int64
 9   Year_of_Journey    10683 non-null  int64
 10  Arrival_Hour       10683 non-null  int64
 11  Arrival_Minutes    10683 non-null  int64
 12  Departure_Hour     10683 non-null  int64
 13  Departure_Minutes  10683 non-null  int64
dtypes: int64(9), object(5)
memory usage: 1.1+ MB

In [686]:
# df["Duration_Hour"] = df.Duration.str.split().str[0].str.split('h').str[0].fillna(0)
df["Duration_Minutes"] = df.Duration.str.split().str[1].str.split('m').str[0].fillna(0) # -> works fine - I wrote

df["Duration_Hour"] = df["Duration"].apply(lambda x: int(x.split()[0].replace('h', '')) if 'h' in x.split()[0] else 0)
# df["Duration_Minutes"] = df["Duration"].apply(lambda x: int(x.split()[1].replace('m', '')) if len(x.split()) > 1 else (int(x.split()[0].replace('m', '')) if 'm' in x.split()[0] else 0)) -> # works came from chatgpt

In [687]:
df.drop('Duration', axis=1, inplace=True)

In [688]:
df.head(5)

,Airline,Source,Destination,Total_Stops,Additional_Info,Price,Day_of_Journey,Month_of_Journey,Year_of_Journey,Arrival_Hour,Arrival_Minutes,Departure_Hour,Departure_Minutes,Duration_Minutes,Duration_Hour
0,IndiGo,Banglore,New Delhi,0,No info,3897,24,3,2019,1,10,22,20,50,2
1,Air India,Kolkata,Banglore,2,No info,7662,1,5,2019,13,15,5,50,25,7
2,Jet Airways,Delhi,Cochin,2,No info,13882,9,6,2019,4,25,9,25,0,19
3,IndiGo,Kolkata,Banglore,1,No info,6218,12,5,2019,23,30,18,5,25,5
4,IndiGo,Banglore,New Delhi,1,No info,13302,1,3,2019,21,35,16,50,45,4

In [689]:
df.Duration_Hour.unique()

array([ 2,  7, 19,  5,  4, 15, 21, 25, 13, 12, 26, 22, 23, 20, 10,  6, 11,
        8, 16,  3, 27,  1, 14,  9, 18, 17, 24, 30, 28, 29, 37, 34, 38, 35,
       36, 47, 33, 32, 31, 42, 39,  0, 41, 40])

In [690]:
df.Duration_Hour = df.Duration_Hour.astype(int)
df.Duration_Minutes = df.Duration_Minutes.astype(int)

In [691]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 15 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Airline            10683 non-null  object
 1   Source             10683 non-null  object
 2   Destination        10683 non-null  object
 3   Total_Stops        10683 non-null  int64
 4   Additional_Info    10683 non-null  object
 5   Price              10683 non-null  int64
 6   Day_of_Journey     10683 non-null  int64
 7   Month_of_Journey   10683 non-null  int64
 8   Year_of_Journey    10683 non-null  int64
 9   Arrival_Hour       10683 non-null  int64
 10  Arrival_Minutes    10683 non-null  int64
 11  Departure_Hour     10683 non-null  int64
 12  Departure_Minutes  10683 non-null  int64
 13  Duration_Minutes   10683 non-null  int64
 14  Duration_Hour      10683 non-null  int64
dtypes: int64(11), object(4)
memory usage: 1.2+ MB

In [692]:
from sklearn.preprocessing import OneHotEncoder

encoder = OneHotEncoder()
encoded_one = encoder.fit_transform(df[['Airline', 'Source', 'Destination', 'Additional_Info']]).toarray()
encoded_df = pd.DataFrame(encoded_one, columns=encoder.get_feature_names_out())
encoded_df.shape

(10683, 33)

In [693]:
df.drop(columns=['Airline', 'Source', 'Destination', 'Additional_Info'], axis=1, inplace=True)

In [694]:
df = pd.concat([df, encoded_df], axis=1)

In [695]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 44 columns):
 #   Column                                        Non-Null Count  Dtype
---  ------                                        --------------  -----
 0   Total_Stops                                   10683 non-null  int64
 1   Price                                         10683 non-null  int64
 2   Day_of_Journey                                10683 non-null  int64
 3   Month_of_Journey                              10683 non-null  int64
 4   Year_of_Journey                               10683 non-null  int64
 5   Arrival_Hour                                  10683 non-null  int64
 6   Arrival_Minutes                               10683 non-null  int64
 7   Departure_Hour                                10683 non-null  int64
 8   Departure_Minutes                             10683 non-null  int64
 9   Duration_Minutes                              10683 non-null  int64
 10  Duration_Hour                                 10683 non-null  int64
 11  Airline_Air Asia                              10683 non-null  float64
 12  Airline_Air India                             10683 non-null  float64
 13  Airline_GoAir                                 10683 non-null  float64
 14  Airline_IndiGo                                10683 non-null  float64
 15  Airline_Jet Airways                           10683 non-null  float64
 16  Airline_Jet Airways Business                  10683 non-null  float64
 17  Airline_Multiple carriers                     10683 non-null  float64
 18  Airline_Multiple carriers Premium economy     10683 non-null  float64
 19  Airline_SpiceJet                              10683 non-null  float64
 20  Airline_Trujet                                10683 non-null  float64
 21  Airline_Vistara                               10683 non-null  float64
 22  Airline_Vistara Premium economy               10683 non-null  float64
 23  Source_Banglore                               10683 non-null  float64
 24  Source_Chennai                                10683 non-null  float64
 25  Source_Delhi                                  10683 non-null  float64
 26  Source_Kolkata                                10683 non-null  float64
 27  Source_Mumbai                                 10683 non-null  float64
 28  Destination_Banglore                          10683 non-null  float64
 29  Destination_Cochin                            10683 non-null  float64
 30  Destination_Delhi                             10683 non-null  float64
 31  Destination_Hyderabad                         10683 non-null  float64
 32  Destination_Kolkata                           10683 non-null  float64
 33  Destination_New Delhi                         10683 non-null  float64
 34  Additional_Info_1 Long layover                10683 non-null  float64
 35  Additional_Info_1 Short layover               10683 non-null  float64
 36  Additional_Info_2 Long layover                10683 non-null  float64
 37  Additional_Info_Business class                10683 non-null  float64
 38  Additional_Info_Change airports               10683 non-null  float64
 39  Additional_Info_In-flight meal not included   10683 non-null  float64
 40  Additional_Info_No Info                       10683 non-null  float64
 41  Additional_Info_No check-in baggage included  10683 non-null  float64
 42  Additional_Info_No info                       10683 non-null  float64
 43  Additional_Info_Red-eye flight                10683 non-null  float64
dtypes: float64(33), int64(11)
memory usage: 3.6 MB

In [696]:
for col in df.columns:
  df[col] = df[col].astype(int)

In [697]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10683 entries, 0 to 10682
Data columns (total 44 columns):
 #   Column                                        Non-Null Count  Dtype
---  ------                                        --------------  -----
 0   Total_Stops                                   10683 non-null  int64
 1   Price                                         10683 non-null  int64
 2   Day_of_Journey                                10683 non-null  int64
 3   Month_of_Journey                              10683 non-null  int64
 4   Year_of_Journey                               10683 non-null  int64
 5   Arrival_Hour                                  10683 non-null  int64
 6   Arrival_Minutes                               10683 non-null  int64
 7   Departure_Hour                                10683 non-null  int64
 8   Departure_Minutes                             10683 non-null  int64
 9   Duration_Minutes                              10683 non-null  int64
 10  Duration_Hour                                 10683 non-null  int64
 11  Airline_Air Asia                              10683 non-null  int64
 12  Airline_Air India                             10683 non-null  int64
 13  Airline_GoAir                                 10683 non-null  int64
 14  Airline_IndiGo                                10683 non-null  int64
 15  Airline_Jet Airways                           10683 non-null  int64
 16  Airline_Jet Airways Business                  10683 non-null  int64
 17  Airline_Multiple carriers                     10683 non-null  int64
 18  Airline_Multiple carriers Premium economy     10683 non-null  int64
 19  Airline_SpiceJet                              10683 non-null  int64
 20  Airline_Trujet                                10683 non-null  int64
 21  Airline_Vistara                               10683 non-null  int64
 22  Airline_Vistara Premium economy               10683 non-null  int64
 23  Source_Banglore                               10683 non-null  int64
 24  Source_Chennai                                10683 non-null  int64
 25  Source_Delhi                                  10683 non-null  int64
 26  Source_Kolkata                                10683 non-null  int64
 27  Source_Mumbai                                 10683 non-null  int64
 28  Destination_Banglore                          10683 non-null  int64
 29  Destination_Cochin                            10683 non-null  int64
 30  Destination_Delhi                             10683 non-null  int64
 31  Destination_Hyderabad                         10683 non-null  int64
 32  Destination_Kolkata                           10683 non-null  int64
 33  Destination_New Delhi                         10683 non-null  int64
 34  Additional_Info_1 Long layover                10683 non-null  int64
 35  Additional_Info_1 Short layover               10683 non-null  int64
 36  Additional_Info_2 Long layover                10683 non-null  int64
 37  Additional_Info_Business class                10683 non-null  int64
 38  Additional_Info_Change airports               10683 non-null  int64
 39  Additional_Info_In-flight meal not included   10683 non-null  int64
 40  Additional_Info_No Info                       10683 non-null  int64
 41  Additional_Info_No check-in baggage included  10683 non-null  int64
 42  Additional_Info_No info                       10683 non-null  int64
 43  Additional_Info_Red-eye flight                10683 non-null  int64
dtypes: int64(44)
memory usage: 3.6 MB